test_model.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="POST single">
        <intProp name="ThreadGroup.num_threads">100</intProp>
        <intProp name="ThreadGroup.ramp_time">100</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">5</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST labwork" enabled="true">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">lab1/api/labwork</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">  {&#xd;
    &quot;name&quot;: &quot;name&quot;,&#xd;
    &quot;description&quot;: &quot;description&quot;,&#xd;
    &quot;difficulty&quot;: &quot;NORMAL&quot;,&#xd;
    &quot;minimalPoint&quot;: 1.0,&#xd;
    &quot;averagePoint&quot;: 2.0,&#xd;
    &quot;discipline&quot;: {&#xd;
      &quot;name&quot;: &quot;discipline&quot;,&#xd;
      &quot;practiceHours&quot;: 90&#xd;
    },&#xd;
    &quot;coordinates&quot;: {&#xd;
      &quot;x&quot;: 1,&#xd;
      &quot;y&quot;: 2&#xd;
    },&#xd;
    &quot;author&quot;: {&#xd;
      &quot;name&quot;: &quot;author&quot;,&#xd;
      &quot;eyeColor&quot;: &quot;BLUE&quot;,&#xd;
      &quot;hairColor&quot;: &quot;BROWN&quot;,&#xd;
      &quot;birthday&quot;: &quot;2025-10-26T22:43:49.54&quot;,&#xd;
      &quot;nationality&quot;: &quot;USA&quot;,&#xd;
      &quot;location&quot;: {&#xd;
        &quot;name&quot;: &quot;location&quot;,&#xd;
        &quot;x&quot;: 1,&#xd;
        &quot;y&quot;: 2,&#xd;
        &quot;z&quot;: 3&#xd;
      }&#xd;
    }&#xd;
  }&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="POST multiple" enabled="true">
        <intProp name="ThreadGroup.num_threads">100</intProp>
        <intProp name="ThreadGroup.ramp_time">100</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">5</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST labworks" enabled="true">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/lab1/api/labwork/batch</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">[&#xd;
  {&#xd;
    &quot;name&quot;: &quot;A&amp;DS 1&quot;,&#xd;
    &quot;description&quot;: &quot;Sorting algorithms&quot;,&#xd;
    &quot;difficulty&quot;: &quot;INSANE&quot;,&#xd;
    &quot;minimalPoint&quot;: 5,&#xd;
    &quot;averagePoint&quot;: 8.5,&#xd;
    &quot;coordinates&quot;: {&#xd;
      &quot;x&quot;: 10.5,&#xd;
      &quot;y&quot;: 20.3&#xd;
    },&#xd;
    &quot;author&quot;: {&#xd;
      &quot;name&quot;: &quot;Legendarych&quot;,&#xd;
      &quot;eyeColor&quot;: &quot;BLUE&quot;,&#xd;
      &quot;hairColor&quot;: &quot;BROWN&quot;,&#xd;
      &quot;birthday&quot;: &quot;2025-10-26T22:43:49.54&quot;,&#xd;
      &quot;nationality&quot;: &quot;SOUTH_KOREA&quot;,&#xd;
      &quot;location&quot;: {&#xd;
        &quot;name&quot;: &quot;Podolsk&quot;,&#xd;
        &quot;x&quot;: 55,&#xd;
        &quot;y&quot;: 37.6173,&#xd;
        &quot;z&quot;: 150.1467&#xd;
      }&#xd;
    },&#xd;
    &quot;discipline&quot;: {&#xd;
      &quot;name&quot;: &quot;Algorithms &amp; Data Structures&quot;,&#xd;
      &quot;practiceHours&quot;: 120&#xd;
    }&#xd;
  },&#xd;
  {&#xd;
    &quot;name&quot;: &quot;CGA 3&quot;,&#xd;
    &quot;description&quot;: &quot;Generating illumination&quot;,&#xd;
    &quot;difficulty&quot;: &quot;IMPOSSIBLE&quot;,&#xd;
    &quot;minimalPoint&quot;: 7,&#xd;
    &quot;averagePoint&quot;: 9.2,&#xd;
    &quot;coordinates&quot;: {&#xd;
      &quot;x&quot;: 15.2,&#xd;
      &quot;y&quot;: 25.8&#xd;
    },&#xd;
    &quot;author&quot;: {&#xd;
      &quot;name&quot;: &quot;Ivan Ivanov&quot;,&#xd;
      &quot;eyeColor&quot;: &quot;YELLOW&quot;,&#xd;
      &quot;hairColor&quot;: &quot;BLACK&quot;,&#xd;
      &quot;birthday&quot;: &quot;2025-10-26T22:43:49.54&quot;,&#xd;
      &quot;nationality&quot;: &quot;USA&quot;,&#xd;
      &quot;location&quot;: {&#xd;
        &quot;name&quot;: &quot;Los-Angeles&quot;,&#xd;
        &quot;x&quot;: 40,&#xd;
        &quot;y&quot;: -74.006,&#xd;
        &quot;z&quot;: 10.345&#xd;
      }&#xd;
    },&#xd;
    &quot;discipline&quot;: {&#xd;
      &quot;name&quot;: &quot;Computer Graphics Algorithms&quot;,&#xd;
      &quot;practiceHours&quot;: 90&#xd;
    }&#xd;
  }&#xd;
]&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="DELETE single" enabled="true">
        <intProp name="ThreadGroup.num_threads">10</intProp>
        <intProp name="ThreadGroup.ramp_time">10</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="DELETE labwork">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/lab1/api/labwork/1403</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">DELETE</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>